Revit 2027 API
SlabShapeEditor.DeletePoint Method
 Delete a SlabShapeVertex from the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool DeletePoint(
	SlabShapeVertex vertex
)
Public Function DeletePoint (
	vertex As SlabShapeVertex
) As Boolean
public:
bool DeletePoint(
	SlabShapeVertex^ vertex
)
member DeletePoint :
        vertex : SlabShapeVertex -> bool
Parameters
vertex SlabShapeVertex
 The SlabShapeVertex to be deleted.
Return Value
Boolean
 True if the vertex is successfully deleted. False if the vertex is not found or could not be deleted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Corner vertices are created right after the SlabShapeEditor is enabled. They are tied with the boundaries so that they could not be deleted individually. They can only be deleted using ResetSlabShape.
See Also
Reference
SlabShapeEditor Class
Autodesk.Revit.DB Namespace